module I18N.Ua exposing (translations)

import I18Next exposing (fromTree, object, string)


translations =
    fromTree
        [ ( "Список Фениксов", string "Список Фенiксiв" )
        , ( "Да", string "Так" )
        , ( "Нет", string "Нi" )
        , ( "themes"
          , object
                [ ( "dark", string "Темна" )
                , ( "light", string "Свiтла" )
                ]
          )
        , ( "menu"
          , object
                [ ( "Системные опции", string "Системнi опцii" )
                , ( "Аккаунт", string "Акаунт" )
                , ( "Язык", string "Мова" )
                , ( "Настройки", string "Налаштування" )
                , ( "Выйти", string "Вийти" )
                , ( "Выйти?", string "Вийти?" )
                , ( "Вы действительно хотите выйти?", string "Ви дiйсно бажаєте вийти?" )
                ]
          )
        , ( "login"
          , object
                [ ( "Добро пожаловать", string "Ласкаво просимо!" )
                , ( "Войдите, чтобы продолжить", string "Увійдіть, щоб продовжити" )
                , ( "Введите Ваш логин", string "Введіть Ваш логін" )
                , ( "name_not_found", string "Імёя користувача не знайдено. Будь ласка перевірте та спробуйте ще раз." )
                , ( "Введите Ваш пароль", string "Введіть Ваш пароль." )
                , ( "Войти в систему", string "Увійти в систему." )
                , ( "У вас нет аккаунта?", string "У Вас немає акаунта?" )
                , ( "Зарегистрироваться", string "Зареєструватись" )
                , ( "Создать аккаунт", string "Створити акаунт" )
                , ( "Чтобы начать работать", string "Щоб почати роботу" )
                , ( "Повторите Ваш пароль", string "Повторіть Ваш пароль" )
                , ( "Я прочитал и принимаю условия", string "Я прочитав і приймаю умови користування" )
                , ( "пользовательского соглашения", string "пользовательского соглашения" )
                , ( "Уже есть аккаунт?", string "Вже є акаунт?" )
                , ( "Введите имя пользователя", string "Введіть ім`я користувача" )
                , ( "Укажите пароль", string "Вкажіть пароль" )
                , ( "Укажите пароль повторно", string "Вкажіть пароль повторно" )
                , ( "Пароль указан неверно", string "Пароль вказаний невірно" )
                , ( "Вы должны принять условия", string "Вы маєте прийняти умови" )
                ]
          )
        , ( "list"
          , object
                [ ( "Добавьте ещё один Феникс", string "Добавте ще один Фенікс" )
                , ( "в список наблюдения", string "в список спостереження" )
                , ( "Добавить", string "Додати" )
                , ( "Режим Поиск:", string "Режим Пошук:" )
                , ( "Режим Ожидание:", string "Режим Очікування:" )
                ]
          )
        , ( "master"
          , object
                [ ( "Далeе", string "Далі" )
                , ( "Назад", string "Назад" )
                , ( "Подготовка SIM-карты", string "Підготовка SIM-карти" )
                , ( "Установите SIM-карту в мобильный телефон.", string "Встановіть SIM – карту в мобільний телефон." )
                , ( "Активируйте SIM-карту в соответствии с инструкциями GSM-оператора.", string "Активуйте сім карту у відповідності до інструкцій  GSM оператора." )
                , ( "Убедитесь в том, что PIN-код при включении телефона выключен.", string "Переконайтесь , що РIN – код при увімкненні телефону вимкнений." )
                , ( "В случае необходимости зарегистрируйте SIM-карту на сайте GSM-оператора.", string "При необхідності зареєструйте SIM-карту на сайті GSM-оператора." )
                , ( "Выключите мобильный телефон и извлеките из него подготовленную SIM-карту.", string "Вимкніть мобільний телефон і дістаньте з нього підготовлену  SIM-карту." )
                , ( "Установка подготовленной SIM-карты в Феникс", string "Встановлення підготовленої SIM-карты в Фенікс" )
                , ( "Выкрутите 4 винта и снимите крышку корпуса.", string "Викрутіть 4 гвинта і зніміть кришку корпусу." )
                , ( "Убедитесь в том, что Феникс выключен – светодиодный индикатор не горит и не мигает.", string "Переконайтесь в тому, що Фенікс вимкнений – світлодіодний індикатор не світиться і не блискає." )
                , ( "Установите подготовленную SIM-карту в Феникс.", string "Встановіть підготовлену  SIM-карту в Фенікс." )
                , ( "В случае необходимости произведите привязку экзекуторов.", string "У випадку необхідності проведіть прив’язку езекуторів." )
                , ( "Привязать экзекутор", string "Прив’язати екзекутор." )
                , ( "Экзекутор в наличии", string "Екзекутор в наявності" )
                , ( "Привязка экзекуторов и активация Феникса", string "Прив’язка екзекуторів і активація Фенікса" )
                , ( "Исходное состояние: Феникс – выключен.", string "Початковий стан: Фенікс вимкнений." )
                , ( "Обесточьте все привязываемые экзекуторы и подготовьте их к подаче питания.", string "Знеструмте усі екзекутори, що будуть прив’язуватись і підготуйте їх до подачі напруги." )
                , ( "Нажмите и удерживайте 3 секунды кнопку Фениска – загорится светодиод.", string "Натисніть і утримуйте 3 секунди кнопку Фенікса  - засвітиться світлодіод." )
                , ( "Как только светодиод загорится – подайте питание на все привязываемые экзекуторы – светодиод отработает серию частых вспышек и начнёт отрабатывать редкие одиночные вспышки.", string "Як тільки світлодіод засвітиться – подайте струм на усі екзекутори, що прив’язуються до даного Фенікса – світлодіод відпрацює серію частих спалахів і почне відпрацьовувати рідкі по одиночні спалахи." )
                , ( "Закройте крышку корпуса Фениска и закрутите 4 винта.", string "Закрийте кришку корпусу Фенікса і закрутіть 4 гвинти." )
                , ( "Активация Феникса", string "Активация Феникса" )
                , ( "Нажмите кнопку Феникса – светодиодный индикатор подтвердит включение.", string "Натисніть кнопку Фенікса - світлодіодний індикатор підтвердить увімкнення." )
                , ( "Закройте крышку корпуса Феникса и закрутите 4 винта.", string "Закрийте кришку корпусу Фенікса і закрутіть 4 гвинти." )
                , ( "Добавление Феникса в наблюдение", string "Додавання Фенікса в спостереження" )
                , ( "Отправьте на телефонный номер SIM-карты Феникса SMS: link", string "Відправте на телефонний номер SIM-карти Фенікса SMS: link" )
                , ( "В ответ придёт уникальный код – введите его в поле ниже:", string "У відповідь прийде унікальний код – введіть його в поле нижче:" )
                , ( "Введите уникальный код из SMS", string "Введіть унікальний код із  SMS" )
                , ( "Подтвердить", string "Подтвердить" )
                , ( "Мастер добавления Феникса", string "Додавання Фенікса в спостереження." )
                , ( "Свериться с", string "Звіритись з" )
                , ( "индикатором", string "індикатором" )
                ]
          )
        ]
